<a href="https://colab.research.google.com/github/XimenaBG/Projects_Data_Analyst_in_Python/blob/main/Exploring_Ebay_Car_Sales_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Guided Project:** Exploring Ebay Car Sales Data

In this guided project, i'll work with a dataset of used cars from eBay Kleinanzeigen, a classifieds section of the German eBay website.
The original dataset isn't available on Kaggle anymore, but you still can find it in t this [link.](https://data.world/data-society/used-cars-data)

I'll use the dataset provided by Dataquest and they've made a few modifications from the original dataset:

1.   Sampled 50,000 data points from the full dataset, to ensure the code runs quickly in their hosted environment. 
2.   Dirtied the dataset a bit to more closely resemble what would be expect from a scraped dataset.

All the information about this guided project can be found in this [mission.](https://app.dataquest.io/m/294/guided-project%3A-exploring-ebay-car-sales-data/1/introduction)

**Objective:** Clean the data and analyze the included used car listings.

Data dictionary:
<br><br>
`dateCrawled` - When this ad was first crawled. All field-values are taken from this date. <br>
`name` - Name of the car. <br>
`seller` - Whether the seller is private or a dealer. <br>
`offerType` - The type of listing. <br>
`price` - The price on the ad to sell the car. <br>
`abtest` - Whether the listing is included in an A/B test. <br>
`vehicleType` - The vehicle Type. <br>
`yearOfRegistration` - The year in which the car was first registered. <br>
`gearbox` - The transmission type.<br>
`powerPS` - The power of the car in PS.<br>
`model` - The car model name.<br>
`kilometer` - How many kilometers the car has driven.<br>
`monthOfRegistration` - The month in which the car was first registered.<br>
`fuelType` - What type of fuel the car uses.<br>
`brand` - The brand of the car.<br>
`notRepairedDamage` - If the car has a damage which is not yet repaired.<br>
`dateCreated `- The date on which the eBay listing was created.<br>
`nrOfPictures` - The number of pictures in the ad.<br>
`postalCode` - The postal code for the location of the vehicle.<br>
`lastSeenOnline` - When the crawler saw this ad last online.<br>

In [2]:
#Import pandas and numpy libraries
import pandas as pd
import numpy as np

In [3]:
#Charge the dataset that is in my drive
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
#Read the dataset, I use encoding 'Latin 1' because without this had an error
autos = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/autos.csv', encoding='latin-1')

In [5]:
#See the ability to render the first few and last few values of any pandas object
autos

               dateCrawled  ...             lastSeen
0      2016-03-26 17:47:46  ...  2016-04-06 06:45:54
1      2016-04-04 13:38:56  ...  2016-04-06 14:45:08
2      2016-03-26 18:57:24  ...  2016-04-06 20:15:37
3      2016-03-12 16:58:10  ...  2016-03-15 03:16:28
4      2016-04-01 14:38:50  ...  2016-04-01 14:38:50
...                    ...  ...                  ...
49995  2016-03-27 14:38:19  ...  2016-04-01 13:47:40
49996  2016-03-28 10:50:25  ...  2016-04-02 14:18:02
49997  2016-04-02 14:44:48  ...  2016-04-04 11:47:27
49998  2016-03-08 19:25:42  ...  2016-04-05 16:45:07
49999  2016-03-14 00:42:12  ...  2016-04-06 21:18:48

[50000 rows x 20 columns]

### **1. Cleaning column names:**

In [6]:
#Methods to evaluate in initial stages the dataset
autos.info()
autos.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   dateCrawled          50000 non-null  object
 1   name                 50000 non-null  object
 2   seller               50000 non-null  object
 3   offerType            50000 non-null  object
 4   price                50000 non-null  object
 5   abtest               50000 non-null  object
 6   vehicleType          44905 non-null  object
 7   yearOfRegistration   50000 non-null  int64
 8   gearbox              47320 non-null  object
 9   powerPS              50000 non-null  int64
 10  model                47242 non-null  object
 11  odometer             50000 non-null  object
 12  monthOfRegistration  50000 non-null  int64
 13  fuelType             45518 non-null  object
 14  brand                50000 non-null  object
 15  notRepairedDamage    40171 non-null  object
 16  dateCreated          50000 non-null  object
 17  nrOfPictures         50000 non-null  int64
 18  postalCode           50000 non-null  int64
 19  lastSeen             50000 non-null  object
dtypes: int64(5), object(15)
memory usage: 7.6+ MB

           dateCrawled  ...             lastSeen
0  2016-03-26 17:47:46  ...  2016-04-06 06:45:54
1  2016-04-04 13:38:56  ...  2016-04-06 14:45:08
2  2016-03-26 18:57:24  ...  2016-04-06 20:15:37
3  2016-03-12 16:58:10  ...  2016-03-15 03:16:28
4  2016-04-01 14:38:50  ...  2016-04-01 14:38:50

[5 rows x 20 columns]

**Observations**
<br>
This dataset has 20 columns and 50.000 rows.<br>
》5 columns are stored as integers, the rest of the columns are stored as strings.
<br>
》5 columns present null values: vehicle type, gearbox, model, fuel type and not repared damage. But these null values don't represent more than 20% of the data available.
<br>
》The column names use camelcase.

In [7]:
print(autos.columns)

Index(['dateCrawled', 'name', 'seller', 'offerType', 'price', 'abtest',
       'vehicleType', 'yearOfRegistration', 'gearbox', 'powerPS', 'model',
       'odometer', 'monthOfRegistration', 'fuelType', 'brand',
       'notRepairedDamage', 'dateCreated', 'nrOfPictures', 'postalCode',
       'lastSeen'],
      dtype='object')

Some changes will be made:

1.   Convert column names from camelcase to snakecase.
2.   Change a few column names.

These changes will help to a better understand of the information from the dataset.

In [8]:
autos.columns = ['date_Crawled', 'name', 'seller', 'offer_Type', 'price', 'abtest',
       'vehicle_Type', 'registration_year', 'gearbox', 'power_PS', 'model',
       'odometer', 'registration_month', 'fuel_Type', 'brand',
       'unrepaired_damage', 'ad_created', 'nr_Pictures', 'postal_Code',
       'last_Seen']

#Following function to convert uppercase letters to lowercase
def clean_col(col):
  col = col.lower()
  return col

new_columns = []
for c in autos.columns:
    clean_c = clean_col(c)
    new_columns.append(clean_c)

autos.columns = new_columns

In [9]:
autos.head()

          date_crawled  ...            last_seen
0  2016-03-26 17:47:46  ...  2016-04-06 06:45:54
1  2016-04-04 13:38:56  ...  2016-04-06 14:45:08
2  2016-03-26 18:57:24  ...  2016-04-06 20:15:37
3  2016-03-12 16:58:10  ...  2016-03-15 03:16:28
4  2016-04-01 14:38:50  ...  2016-04-01 14:38:50

[5 rows x 20 columns]

### **2. Initial exploration and cleaning:**

In [10]:
#  to look at descriptive statistics for all columns
autos.describe(include='all')

               date_crawled         name  ...   postal_code            last_seen
count                 50000        50000  ...  50000.000000                50000
unique                48213        38754  ...           NaN                39481
top     2016-03-27 22:55:05  Ford_Fiesta  ...           NaN  2016-04-07 06:17:27
freq                      3           78  ...           NaN                    8
mean                    NaN          NaN  ...  50813.627300                  NaN
std                     NaN          NaN  ...  25779.747957                  NaN
min                     NaN          NaN  ...   1067.000000                  NaN
25%                     NaN          NaN  ...  30451.000000                  NaN
50%                     NaN          NaN  ...  49577.000000                  NaN
75%                     NaN          NaN  ...  71540.000000                  NaN
max                     NaN          NaN  ...  99998.000000                  NaN

[11 rows x 20 columns]

**Observations**<br>
》`seller`, `offer_type`, `abtest`, `gearbox` and `unrepaired_damage`, are columns that have two unique values and are candidates to be dropped.
<br>
》`registration_year`, is a column that needs more investigation because its max value is 9999 a bit strange.
<br>
》`price` and `odometer` are examples of numeric data stored as text and needs to be cleaned.

In [11]:
#corrections for column odometer: remove non numeric characters ('km' and ','), convert values to numeric, rename column
autos["odometer"] = autos["odometer"].str.replace('km','')
autos["odometer"] = autos["odometer"].str.replace(',','')
autos["odometer"] = autos["odometer"].astype(int)
autos.rename({"odometer": "odometer_km"}, axis = 1, inplace = True)
autos["odometer_km"].head()

0    150000
1    150000
2     70000
3     70000
4    150000
Name: odometer_km, dtype: int64

In [12]:
#corrections for column price: remove non numeric characters ('$' and ','), convert values to numeric
autos["price"] = autos["price"].str.replace('$','')
autos["price"] = autos["price"].str.replace(',','')
autos["price"] = autos["price"].astype(int)
autos["price"].head()

0    5000
1    8500
2    8990
3    4350
4    1350
Name: price, dtype: int64

### **3. Exploring the odometer and price columns:**

Now I'm going to use some techniques to explore the data in these two columns:

In [13]:
#create a variable to store only each column and explore them using some techniques
odometer_km_c = autos["odometer_km"]
price_c = autos["price"]

#how many unique values has each column
print('Unique values odometer_km:', odometer_km_c.unique().shape)
print('\n')
print('Unique values price:', price_c.unique().shape)
print('\n')
#some statistical data from each column
print('Statistics odometer_km:', odometer_km_c.describe())
print('\n')
print('Statistic price:', price_c.describe())

Unique values odometer_km: (13,)


Unique values price: (2357,)


Statistics odometer_km: count     50000.000000
mean     125732.700000
std       40042.211706
min        5000.000000
25%      125000.000000
50%      150000.000000
75%      150000.000000
max      150000.000000
Name: odometer_km, dtype: float64


Statistic price: count    5.000000e+04
mean     9.840044e+03
std      4.811044e+05
min      0.000000e+00
25%      1.100000e+03
50%      2.950000e+03
75%      7.200000e+03
max      1.000000e+08
Name: price, dtype: float64

》Here is interesting that the unique odometer values are only 13, in this moment i am not very sure about the reason for that. Maybe is because the cars are organised by ranges of km. In the next step i'll be making some counts and i expect to have a better understanding.

In [14]:
#counting the number of entries that are same for odometer
print('Odometer_km:','\n', odometer_km_c.value_counts().sort_index(ascending=False))

Odometer_km:
 150000    32424
125000     5170
100000     2169
90000      1757
80000      1436
70000      1230
60000      1164
50000      1027
40000       819
30000       789
20000       784
10000       264
5000        967
Name: odometer_km, dtype: int64

As we can see in the last cell the values of the odometer are rounded and organized in some ranges. And a great quantity of cars had more than 150.000 km.

In [15]:
#counting the number of entries that are same for price
print('Price high:','\n', price_c.value_counts().sort_index(ascending=False).head(20))
print('\n')
print('Price low:','\n', price_c.value_counts().sort_index(ascending=True).head(20))

Price high:
 99999999    1
27322222    1
12345678    3
11111111    2
10000000    1
3890000     1
1300000     1
1234566     1
999999      2
999990      1
350000      1
345000      1
299000      1
295000      1
265000      1
259000      1
250000      1
220000      1
198000      1
197000      1
Name: price, dtype: int64


Price low:
 0     1421
1      156
2        3
3        1
5        2
8        1
9        1
10       7
11       2
12       3
13       2
14       1
15       2
17       3
18       1
20       4
25       5
29       1
30       7
35       1
Name: price, dtype: int64

》In the column price there are more interesting things like cars by a price of $0, that have to be an error so maybe it will be better delete that rows (1.421 from 50.000). On the other hand, are the expensive cars not many but at least 13 cost more than 1 million USD.
<br><br>
As eBay is an auction site I wil maintain the items with a value of 1 but i'll limit the selecticon to the prices of 350.000 USD.

In [16]:
#removing the rows that don't seem reliable
autos = autos[autos["price"].between(1,351000)]
autos["price"].describe()

count     48565.000000
mean       5888.935591
std        9059.854754
min           1.000000
25%        1200.000000
50%        3000.000000
75%        7490.000000
max      350000.000000
Name: price, dtype: float64

**Observations**<br>
》Now we have a dataset with 48.565 rows and cleaner.

### **4. Exploring the date columns:**

Right now, the `date_crawled`, `last_seen`, and `ad_created `columns are all identified as string values by pandas. Because these three columns are represented as strings, we need to convert the data into a numerical representation so we can understand it quantitatively.

In [17]:
autos[['date_crawled','ad_created','last_seen']][0:5]

          date_crawled           ad_created            last_seen
0  2016-03-26 17:47:46  2016-03-26 00:00:00  2016-04-06 06:45:54
1  2016-04-04 13:38:56  2016-04-04 00:00:00  2016-04-06 14:45:08
2  2016-03-26 18:57:24  2016-03-26 00:00:00  2016-04-06 20:15:37
3  2016-03-12 16:58:10  2016-03-12 00:00:00  2016-03-15 03:16:28
4  2016-04-01 14:38:50  2016-04-01 00:00:00  2016-04-01 14:38:50

The first 10 characters represent the day. To understand the date range, we can extract just the date values.

In [18]:
#extract the date values, first 10 characters
data_crawled = autos['date_crawled'].str[:10]
ad_created = autos['ad_created'].str[:10]
last_seen = autos['last_seen'].str[:10]

To calculate the distribution of values as percentages.

In [19]:
print(data_crawled.value_counts(normalize=True, dropna=False).sort_index(ascending=True).head(10))
print(ad_created.value_counts(normalize=True, dropna=False).sort_index(ascending=False).head(10))
print(last_seen.value_counts(normalize=True, dropna=False).sort_index(ascending=False).head(10))

2016-03-05    0.025327
2016-03-06    0.014043
2016-03-07    0.036014
2016-03-08    0.033296
2016-03-09    0.033090
2016-03-10    0.032184
2016-03-11    0.032575
2016-03-12    0.036920
2016-03-13    0.015670
2016-03-14    0.036549
Name: date_crawled, dtype: float64
2016-04-07    0.001256
2016-04-06    0.003253
2016-04-05    0.011819
2016-04-04    0.036858
2016-04-03    0.038855
2016-04-02    0.035149
2016-04-01    0.033687
2016-03-31    0.031875
2016-03-30    0.033501
2016-03-29    0.034037
Name: ad_created, dtype: float64
2016-04-07    0.131947
2016-04-06    0.221806
2016-04-05    0.124761
2016-04-04    0.024483
2016-04-03    0.025203
2016-04-02    0.024915
2016-04-01    0.022794
2016-03-31    0.023783
2016-03-30    0.024771
2016-03-29    0.022341
Name: last_seen, dtype: float64

In [20]:
autos['registration_year'].describe()

count    48565.000000
mean      2004.755421
std         88.643887
min       1000.000000
25%       1999.000000
50%       2004.000000
75%       2008.000000
max       9999.000000
Name: registration_year, dtype: float64

》In the last cell I find some strange values of years like 1.000  and 9.999. So I will choose a range more accurate to define which information could be interesting to analyze.<br>
The car was invented in 1885 as this [link](https://www.loc.gov/everyday-mysteries/item/who-invented-the-automobile/#:~:text=Exactly%20who%20invented%20the%20automobile,true%20automobile%20in%201885%2F1886.) said, so my lowest value will be 1910 maybe people start to register cars in these days. And the maximum will be 2016 the year of creation of the dataset, so a registration year above 2016 is definitely inaccurate.

In [21]:
#removing the rows that don't seem reliable
autos = autos[autos['registration_year'].between(1910,2016)]
print(autos['registration_year'].value_counts(normalize=True))
print('\n')
print(autos['registration_year'].describe())

2000    0.067608
2005    0.062895
1999    0.062060
2004    0.057904
2003    0.057818
          ...
1938    0.000021
1948    0.000021
1927    0.000021
1931    0.000021
1952    0.000021
Name: registration_year, Length: 78, dtype: float64


count    46681.000000
mean      2002.910756
std          7.185103
min       1910.000000
25%       1999.000000
50%       2003.000000
75%       2008.000000
max       2016.000000
Name: registration_year, dtype: float64

**Observations**<br>
》Now we have a dataset with 46.681 rows, in the last cell I delete 1881 rows from years that don't seem accurate.

### **5. Exploring Price by Brand:**

In [22]:
autos["brand"].value_counts(normalize=True)

volkswagen        0.211264
bmw               0.110045
opel              0.107581
mercedes_benz     0.096463
audi              0.086566
ford              0.069900
renault           0.047150
peugeot           0.029841
fiat              0.025642
seat              0.018273
skoda             0.016409
nissan            0.015274
mazda             0.015188
smart             0.014160
citroen           0.014010
toyota            0.012703
hyundai           0.010025
sonstige_autos    0.009811
volvo             0.009147
mini              0.008762
mitsubishi        0.008226
honda             0.007840
kia               0.007069
alfa_romeo        0.006641
porsche           0.006127
suzuki            0.005934
chevrolet         0.005698
chrysler          0.003513
dacia             0.002635
daihatsu          0.002506
jeep              0.002271
subaru            0.002142
land_rover        0.002099
saab              0.001649
jaguar            0.001564
daewoo            0.001500
trabant           0.001392
rover             0.001328
lancia            0.001071
lada              0.000578
Name: brand, dtype: float64

》German brands represent around the %50 of the data. The most popular brand is Volkswagen followed by BMW.<br>

There are a lot of brands that seem not to have many listings and for that reason I will limit my analysis only to the first 20 brands.

In [32]:
top_brand_prices = {}
brands = autos["brand"].value_counts(normalize=True)
brands = brands[:20].index
for brand in brands:
  brand_only = autos[autos["brand"] == brand]
  mean_price = brand_only["price"].mean()
  top_brand_prices[brand] = int(mean_price)

top_brand_prices

{'audi': 9336,
 'bmw': 8332,
 'citroen': 3779,
 'fiat': 2813,
 'ford': 3749,
 'hyundai': 5365,
 'mazda': 4112,
 'mercedes_benz': 8628,
 'mini': 10613,
 'nissan': 4743,
 'opel': 2975,
 'peugeot': 3094,
 'renault': 2474,
 'seat': 4397,
 'skoda': 6368,
 'smart': 3580,
 'sonstige_autos': 12338,
 'toyota': 5167,
 'volkswagen': 5402,
 'volvo': 4946}

From the results for the first 20 brands of the data we can observe the following:

1.   'mini', 'audi' and 'mercedes_benz' are the most expensive brands, actually the most expensive is 'sonstige_autos' but this is a miscelaneous label and for that reason this information is difficult to use.
2.   'renault', 'fiat' and 'opel' are the cheapest brands from the dataset.

### **6. Storing Aggregate Data in a DataFrame:**

In [33]:
bmp_series = pd.Series(top_brand_prices)
pd.DataFrame(bmp_series, columns=["mean_price"])

                mean_price
volkswagen            5402
bmw                   8332
opel                  2975
mercedes_benz         8628
audi                  9336
ford                  3749
renault               2474
peugeot               3094
fiat                  2813
seat                  4397
skoda                 6368
nissan                4743
mazda                 4112
smart                 3580
citroen               3779
toyota                5167
hyundai               5365
sonstige_autos       12338
volvo                 4946
mini                 10613

In [35]:
brand_mean_mileage = {}

for brand in brands:
    brand_only = autos[autos["brand"] == brand]
    mean_mileage = brand_only["odometer_km"].mean()
    brand_mean_mileage[brand] = int(mean_mileage)

mean_mileage = pd.Series(brand_mean_mileage).sort_values(ascending=False)
mean_prices = pd.Series(top_brand_prices).sort_values(ascending=False)

In [36]:
brand_info = pd.DataFrame(mean_mileage,columns=['mean_mileage'])
brand_info

                mean_mileage
volvo                 138067
bmw                   132572
mercedes_benz         130788
opel                  129310
audi                  129157
volkswagen            128707
renault               128071
peugeot               127153
mazda                 124464
ford                  124266
seat                  121131
citroen               119694
nissan                118330
fiat                  117121
toyota                115944
skoda                 110848
hyundai               106442
smart                  99326
sonstige_autos         89956
mini                   88105

In [37]:
brand_info["mean_price"] = mean_prices
brand_info

                mean_mileage  mean_price
volvo                 138067        4946
bmw                   132572        8332
mercedes_benz         130788        8628
opel                  129310        2975
audi                  129157        9336
volkswagen            128707        5402
renault               128071        2474
peugeot               127153        3094
mazda                 124464        4112
ford                  124266        3749
seat                  121131        4397
citroen               119694        3779
nissan                118330        4743
fiat                  117121        2813
toyota                115944        5167
skoda                 110848        6368
hyundai               106442        5365
smart                  99326        3580
sonstige_autos         89956       12338
mini                   88105       10613

From the results for the first 20 brands of the data we can observe that don't exist an apparent relation between the cost and the mileage.

1.   The most expensive brands: 'audi' and 'mercedes_benz' show a mileage around 130.000 km. 'mini' shows a mileage of around 88.000 km
2.   The cheapest brands: 'renault', 'fiat' and 'opel' show a mileage around 130.000 km.

Data cleaning next steps:
Identify categorical data that uses german words, translate them and map the values to their english counterparts
Convert the dates to be uniform numeric data, so "2016-03-21" becomes the integer 20160321.
See if there are particular keywords in the name column that you can extract as new columns.<br><br>
Analysis next steps:
Find the most common brand/model combinations
Split the odometer_km into groups, and use aggregation to see if average prices follows any patterns based on the mileage.
How much cheaper are cars with damage than their non-damaged counterparts?